{
    "ChanDingYin": {
    "method": "Place the left hand with the palm facing upward, and position the right hand above it. Let the tips of the thumbs touch each other."
    },
    "HuoYanYin": {
    "method":"Press the right thumb on top of the nails of the middle finger and ring finger. Extend the index finger and place it vertically against the left palm, with the right index finger pressing at the base of the middle finger."
    },
    "MiTuoDingYin": {
    "method": "Cross the hands, extending the thumbs with their fingertips touching each other. Keep the index fingers straight and vertically aligned, with the fingertips touching the thumbs.  Additionally, let the pinky, ring finger, and middle finger cross each other, supporting the thumbs and index fingers."
    },
    "Retsu": {
    "method":"Adopt the Vajra Fist gesture with both hands. Straighten the index finger of the left hand, while the pinky of the right hand wraps around and holds the first joint of the index finger on the left hand. The tip of the left hand's index finger should be supporting the first joint of the right thumb."
    },
    "Rin": {
    "method": "Raise the index fingers of both hands upright, while the other fingers remain bent and joined together."
    },
    "TaiJiYin": {
    "method": "with the left hand and grasp the four fingers of the right hand.Similarly, form a the right hand and hold the thumb of the left hand.      At the same time, the left thumb presses against the base (proximal phalanx) of the right ring finger, and the right thumb presses against the top (distal phalanx) of the right middle finger.      The two hands embrace each other, and the thumbs create a 'Tai Chi Diagram shape."
    },
    "Zai": {
    "method":"Both hands form a triangular shape with the thumbs and index fingers."
    },
    "Zen": {
    "method":"The left thumb and index finger are closed together, and the remaining fingers of the left hand are lightly curled into a fist, while the right hand covers and protects the left hand."
    },
    "ZhiJiXiangYin": {
    "method": "Each hand supports the middle finger with the thumb, forming a \"flicking\" or \"snapping\" gesture, while keeping the other fingers extended.  The left hand rests in front of the chest, palm facing upward, and the right hand covers it without making direct contact."
    }
    }